In [2]:
import pandas as pd

In [3]:
import sqlite3

In [5]:
create_table = """
CREATE TABLE student_score
(Id INTEGER, Name VARCHAR(20), MAth REAL,
Science REAL
);"""

In [6]:
executeSQL = sqlite3.connect(":memory:")
executeSQL.execute(create_table)
executeSQL.commit()

In [7]:
SQL_query = executeSQL.execute('select * from student_score')

In [8]:
resultset = SQL_query.fetchall()

In [13]:
resultset

[]

In [10]:
insertSQL = [(10,'Jack',85,92),(29,'Tom',73,89),(65,'Ram',65.5,77),(5,'Steve',55,91)]

In [11]:
insert_statement = "Insert into student_score values(?,?,?,?)"
executeSQL.executemany(insert_statement,insertSQL)
executeSQL.commit()

In [12]:
SQL_query = executeSQL.execute("select * from student_score")

In [14]:
resultset = SQL_query.fetchall()

In [15]:
resultset

[(10, u'Jack', 85.0, 92.0),
 (29, u'Tom', 73.0, 89.0),
 (65, u'Ram', 65.5, 77.0),
 (5, u'Steve', 55.0, 91.0)]

In [17]:
df_student_records = pd.DataFrame(resultset,columns=zip(*SQL_query.description)[0])

In [18]:
df_student_records

   Id   Name  MAth  Science
0  10   Jack  85.0     92.0
1  29    Tom  73.0     89.0
2  65    Ram  65.5     77.0
3   5  Steve  55.0     91.0